a         yukarı cell ekler. 
dd        cell siler.
ctrl + enter bulunduğu cell i çalıştırır.
shit + enter bulunduğu cell çalıştırırp alt cell e geçer.

In [2]:
# Dilim objesi oluşturma    
# slice() fonksiyonu, bir dilim (slice) objesi oluşturmak için kullanılır. 
# Dilim objeleri, bir dizinin belirli bir aralığını veya bir alt dizisini seçmek için kullanılır. 
# slice(start, stop, step) 

s = slice(2, 7, 2)

# Bir dizi üzerinde dilimleme işlemi yapma
arr = [2, 4, 7, 8, 10, 11, 14, 16, 18, 19]
result = arr[s]

print(result)  # [2, 4, 6]

[7, 10, 14]

In [3]:
# Dilim objesi oluşturma
#Bu kodda, slice() fonksiyonu ile bir dilim objesi oluşturulur. 
# Bu dilim objesi, başlangıç indeksi 1, bitiş indeksi 9 ve adım 2 olan bir dilimi temsil eder. 
#Daha sonra, bu dilim objesi my_list adlı liste üzerinde kullanılarak dilimleme işlemi yapılır.

s = slice(1, 9, 2)

# Bir liste üzerinde dilimleme işlemi yapma
my_list = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
sliced_list = my_list[s]

print(sliced_list)  # ['b', 'd', 'f', 'h']

#Sonuç olarak, [1, 3, 5, 7] dilimi elde edilir.

['b', 'd', 'f', 'h']

In [4]:
 Age = [25, 30, 22, 35, 28,28]
import numpy as np

In [5]:
np.mean(Age)

28.0

In [6]:
np.median(Age)

28.0

In [7]:
np.var(Age)

16.333333333333332

In [8]:
np.std(Age)

4.041451884327381

In [9]:
age_2= np.array(Age)

In [10]:
age_2 +5

array([30, 35, 27, 40, 33, 33])

Python'da veri işleme ve analiz için güçlü bir kütüphane olan Pandas, veri analizi becerilerinizi önemli ölçüde geliştirebilecek çok sayıda işlevsellik sunar.

In [11]:
import pandas as pd

# Creating a basic example dataset
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Emily','Emily'],
    'Age': [25, 30, 22, 35, 28,28],
    'Salary': [50000, 60000, 45000, 70000, 55000,55000],
    'Department': ['HR', 'Finance', 'IT', 'Marketing', 'HR','HR']
}

df = pd.DataFrame(data)
print(df)

      Name  Age  Salary Department
0    Alice   25   50000         HR
1      Bob   30   60000    Finance
2  Charlie   22   45000         IT
3    David   35   70000  Marketing
4    Emily   28   55000         HR
5    Emily   28   55000         HR

In [12]:
df = df.drop_duplicates() # 2 veya daha fazla aynı satır varsa bir tane bırakır kalanını siler.

In [13]:
df

      Name  Age  Salary Department
0    Alice   25   50000         HR
1      Bob   30   60000    Finance
2  Charlie   22   45000         IT
3    David   35   70000  Marketing
4    Emily   28   55000         HR

In [14]:
df.head()

      Name  Age  Salary Department
0    Alice   25   50000         HR
1      Bob   30   60000    Finance
2  Charlie   22   45000         IT
3    David   35   70000  Marketing
4    Emily   28   55000         HR

In [15]:
df.tail()

      Name  Age  Salary Department
0    Alice   25   50000         HR
1      Bob   30   60000    Finance
2  Charlie   22   45000         IT
3    David   35   70000  Marketing
4    Emily   28   55000         HR

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        5 non-null      object
 1   Age         5 non-null      int64
 2   Salary      5 non-null      int64
 3   Department  5 non-null      object
dtypes: int64(2), object(2)
memory usage: 200.0+ bytes

In [17]:
df.describe()

             Age        Salary
count   5.000000      5.000000
mean   28.000000  56000.000000
std     4.949747   9617.692031
min    22.000000  45000.000000
25%    25.000000  50000.000000
50%    28.000000  55000.000000
75%    30.000000  60000.000000
max    35.000000  70000.000000

In [18]:
# Grouping and aggregating data
grouped_df = df.groupby('Department').agg({'Salary': 'mean', 'Age': 'max'})
print(grouped_df)

             Salary  Age
Department
Finance     60000.0   30
HR          52500.0   28
IT          45000.0   22
Marketing   70000.0   35

In [19]:
# Filtering data based on conditions
filtered_df = df[df['Age'] > 25]
print(filtered_df)

    Name  Age  Salary Department
1    Bob   30   60000    Finance
3  David   35   70000  Marketing
4  Emily   28   55000         HR

In [20]:
# Sorting data
sorted_df = df.sort_values(by='Salary', ascending=False)
print(sorted_df)

      Name  Age  Salary Department
3    David   35   70000  Marketing
1      Bob   30   60000    Finance
4    Emily   28   55000         HR
0    Alice   25   50000         HR
2  Charlie   22   45000         IT

In [21]:
df

      Name  Age  Salary Department
0    Alice   25   50000         HR
1      Bob   30   60000    Finance
2  Charlie   22   45000         IT
3    David   35   70000  Marketing
4    Emily   28   55000         HR

In [45]:
# yapma df = df.drop(columns= "Age" ) # görmek istemediğin kolonu tablodan kaldırma. riskli bunu yapmadan önce baştan veriyi kopya yapman gerekir.

In [22]:
# Orijinal veri setinin yedeği
original_df = df.copy()

# Kolonu kaldırma işlemi
df = df.drop(columns="Age")

# Orijinal veri setinin bir kopyasını kullanarak kolonu geri getirme
df["Age"] = original_df["Age"] # bu sefer sonradan eklediğin için sona atar.

In [27]:
# Eksik veya NULL değerler analizinizi etkileyebilir. Veri bütünlüğünü korumak için bu değerleri boş dizelerle değiştireceğiz.
df = df.fillna('')

In [1]:
# NESNE YÖNELİMLİ PROGRAMLAMA 
# bir sınıf belirlersin ortak özellikleri olan objeleri aynı sınıfa alırsın. 
# class = amaç gerçek hayattaki bir nesneyi modellemek ve yeni oluşturulan veri tipi üzerinde çalışmak.  pc, insan, hayvan
#İçinde belli bir veriyi barındırır. ve manipülasyon yapılabilir. Değerler değiştirilebilir. 
# class örnekleri ; str, insan, araba,
# bir mağazayı ele alalım. class = müşteri (adı,soyadı,yaş,email,id), ürün(adı,stok kodu, stok adedi, fiyat) personel(adı,soyadı,maaş,departman)

In [28]:
class Person: # özellik ve methodlar(işlevler ) barındırır. 
    def speak(self): #method
        print(f"{self.name} konuştu.")
    def eat(self):   #method
        print(f"{self.name} yemek yedi.")


insan1 = Person() # bir class dan üretilmiş bir nesne yarattık instance yaptık.
insan2 = Person()
insan3 = Person() #  bir class dan üretilmiş bir nesne yarattık instance yaptık.

In [29]:
insan1.name = "Elif"
insan1.speak()

Elif konuştu.

In [30]:
insan4 = Person()
insan4.name = "Selim"
insan4.eat()

Selim yemek yedi.

In [31]:
class Person: # özellik ve methodlar(işlevler ) barındırır. 
    def __init__(self,name): # bpş nesne yarattık.
        self.name = name

    def speak(self): #method
        print(f"{self.name} konuştu.")
        
    def eat(self):   #method
        print(f"{self.name} yemek yedi.")

In [32]:
insan1 = Person(name="selim")
insan1.speak()
insan1.eat()

selim konuştu.
selim yemek yedi.

In [34]:
class Person: # özellik ve methodlar(işlevler ) barındırır. 
    def __init__(self,name, surname, yaş): # boş nesne yarattık. başlangıçnoktası
        self.name = name        # boş nesne üzerinde manipülasyon yapılır.
        self.surname = surname
        self.yaş = yaş

    def speak(self): #bu methodlar sınıfın davranışlarını ,işlevlerini tanımlar. # bu methodların tamamı da üstte boş yarattığımız nesnenin methodlarını işlevlerini ifade eder.
        print(f"{self.name} {self.surname}  konuştu.")
        
    def eat(self):   #method
        print(f"{self.name} yemek yedi.")

In [36]:
insan2 = Person(name="selim",surname="asa",yaş=20)
insan2.speak()

selim asa  konuştu.

In [37]:
class Araba():
    def __init__(self,marka,model,fiyat,renk):
        self.gelenmarka = marka
        self.gelenmodel = model
        self.gelenfiyat = fiyat
        self.gelenrenk = renk
    
    def bilgileriyazdır(self):
        print(self.gelenmarka, self.gelenmodel, self.gelenfiyat, self.gelenrenk)

In [38]:
araba1 = Araba("Renault", "Clio", 40_000, "Mavi")  # bir class dan üretilmiş bir nesne yarattık instance yaptık.
araba2 = Araba("Ford", "Mustang", 120_000, "Kırmızı")

In [40]:
araba1

In [41]:
araba1.bilgileriyazdır()

Renault Clio 40000 Mavi

In [42]:
class Araba():
    def __init__(self,marka,model,fiyat,renk):
        self.gelenmarka = marka
        self.gelenmodel = model
        self.gelenfiyat = fiyat
        self.gelenrenk = renk
    
    def bilgileriyazdır(self):
        print(self.gelenmarka, self.gelenmodel, self.gelenfiyat, self.gelenrenk)

    def renkdegistir(self,renk):
        self.gelenrenk = renk

In [43]:
araba1 = Araba("Renault", "Clio", 40_000, "Mavi")
araba1.renkdegistir("Yeşil")
araba1.bilgileriyazdır()

Renault Clio 40000 Yeşil